{
    "questions": [{
        "question": "Which choice best summarizes the passage?",
        "answerschoices": ["A.) A character describes his dislike for his new job and considers the reasons why.", "B.) Two characters employed in the same office become increasingly competitive.", "C.) A young man regrets privately a choice that he defends publicly.", "D.) A new employee experiences optimism, then frustration, and finally despair." ]
    },{
        "question": "The main purpose of the opening sentence of the passage is to",
        "answerschoices": ["A.) establish the narrator’s perspective on a controversy.", "B.) provide context useful in understanding the narrator’s emotional state.", "C.) offer a symbolic representation of Edward Crimsworth’s plight. ", "D.) contrast the narrator’s good intentions with his malicious conduct. " ]
    },{
        "question": "During the course of the first paragraph, the narrator’s focus shifts from",
        "answerschoices": ["A.) recollection of past confidence to acknowledgment of present self-doubt.", "B.) reflection on his expectations of life as a tradesman to his desire for another job.", "C.) generalization about job dissatisfaction to the specifics of his own situation. ", "D.) evaluation of factors making him unhappy to identification of alternatives. " ]
    },{
        "question": "The references to “shade” and “darkness” at the end of the first paragraph mainly have which effect?",
        "answerschoices": ["A.) They evoke the narrator’s sense of dismay.", "B.) They reflect the narrator’s sinister thoughts.", "C.) They capture the narrator’s fear of confinement.", "D.) They reveal the narrator’s longing for rest." ]
    },{
        "question": "The passage indicates that Edward Crimsworth’s behavior was mainly caused by his",
        "answerschoices": ["A.) impatience with the narrator’s high spirits.", "B.) scorn of the narrator’s humble background.", "C.) indignation at the narrator’s rash actions.", "D.) jealousy of the narrator’s apparent superiority." ]
    },{
        "question": "The passage indicates that when the narrator began working for Edward Crimsworth, he viewed Crimsworth as a",
        "answerschoices": ["A.) harmless rival.", "B.) sympathetic ally.", "C.) perceptive judge.", "D.) demanding mentor." ]
    },{
        "question": "Which choice provides the best evidence for the answer to the previous question?",
        "answerschoices": ["A.) Lines 28-31 (&#34;the antipathy... life&#34;)", "B.) Lines 38-40 (&#34;My southern... irritated him&#34;)", "C.) Lines 54-56 (&#34;Day... slumber&#34;)", "D.) Lines 61-62 (&#34;I had... brother&#34;)" ]
    },{
        "question": "At the end of the second paragraph, the comparisons of abstract qualities to a lynx and a snake mainly have the effect of",
        "answerschoices": ["A.) contrasting two hypothetical courses of action.", "B.) conveying the ferocity of a resolution.", "C.) suggesting the likelihood of an altercation.", "D.) illustrating the nature of an adversarial relationship." ]
    },{
        "question": "The passage indicates that, after a long day of work, the narrator sometimes found his living quarters to be",
        "answerschoices": ["A.) treacherous.", "B.) dreary.", "C.) predictable.", "D.) intolerable." ]
    },{
        "question": "Which choice provides the best evidence for the answer to the previous question?",
        "answerschoices": ["A.) Lines 17-21 (&#34;I should... scenes&#34;)", "B.) Lines 21-23 (&#34;I should... lodgings&#34;)", "C.) Lines 64-67 (&#34;Thoughts... phrases&#34;)", "D.) Lines 68-74 (&#34;I walked... gleam&#34;)" ]
    }]
}